Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/disability_and_illness/treatment_benefit_scheme.html.txt.tmx
Source language: en
Languages: ga

source: The Treatment Benefit Scheme is a scheme run by the Department of Social Protection (DSP) that provides dental, optical and aural services to qualified people
ga: Is scéim í an Scéim um Sochar Cóireála a reáchtálann an Roinn Coimirce Sóisialaí agus a chuireann seirbhísí fiaclóireachta, súl agus cluas ar fáil do dhaoine incháilithe

source: The Treatment Benefit Scheme is available to insured workers and retired people who have the required number of PRSI contributions
ga: Tá an Scéim um Sochar Cóireála ar fáil d'oibrithe a bhfuil árachas acu agus do dhaoine atá ar scor agus a bhfuil an líon ceart ranníocaíochtaí ÁSPC acu

source: Medical card holders are legally entitled to more extensive dental, ophthalmic and aural services from the Health Service Executive (HSE) but, in practice, the availability of these services varies from area to area
ga: Tá sealbhóirí cártaí leighis go dleathach i dteideal seirbhísí fiaclóireachta, oftalmacha agus seirbhísí cluas a fháil ó Fheidhmeannacht na Seirbhíse Sláinte (FSS) ach, i ndáiríre, bíonn éagsúil san bhfáil a bhíonn ar na seirbhísí sin ó limistéar go limistéar

source: From 27 March 2017, the Treatment Benefit Scheme has been extended to also cover self-employed people who pay Class S PRSI
ga: Faoin Scéim um Sochar Cóireála, is féidir leat a bheith incháilithe le haghaidh:

source: Treatment Benefit in the EU
ga: Sochar Cóireála san AE

source: If you choose to have treatment in another EU member state, the Department will pay an amount equivalent to the rate paid for similar treatments carried out in Ireland or, the amount actually paid for the treatment - whichever is the lower
ga: Sa chás go roghnaíonn tú cóireáil a bheith agat i mballstát eile de chuid an AE, íocfaidh an Roinn suim comhionann leis an ráta a íocadh le haghaidh cóireálacha comhchosúla a rinneadh in Éirinn nó, an suim díreach a íocadh ar an gcóireáil - cibé acu is ísle

source: You must still have the qualifying PRSI contributions
ga: Caithfidh na ranníocaíochtaí ÁSPC incháilithe a bheith agat fós

source: Contact the Treatment Benefit Section before you travel to get an application form and details of the amounts the Department will pay
ga: Sula dtaistileoidh tú téigh i dteagmháil leis an Rannóg Sochar Cóireála chun foirm iarratas agus sonraí an méid a bheith íoctha ag an Roinn a fháil

source: You must have paid Class A, E, P, H or S social insurance contributions
ga: Ní mór duit ranníocaíochtaí árachais shóisialta Aicme A, E, P, H nó S a bheith íoctha agat

source: The amount of social insurance you need depends on your age
ga: Braitheann an méid árachais shóisialaigh atá ag teastáil uait ar d'aois

source: If you are aged under 21, you may qualify if you have paid at least 39 contributions at any time
ga: Má tá tú faoi 21 bliain d'aois, féadfaidh tú cáiliú má tá ar a laghad 39 ranníocaíocht íoctha agat ag aon tráth

source: Between these ages you may qualify if you have paid at least 39 contributions and
ga: Féadfaidh tú cáiliú idir na haoiseanna sin má tá ar a laghad 39 ranníocaíocht íoctha agat agus

source: • At least 39 paid or credited in the governing contribution year (2015 is the governing contribution year for claims made in 2017) and 13 paid contributions in a recent contribution year or
ga: • Ar a laghad 39 íoctha nó curtha chun sochair agat sa bhliain ranníoca atá i réim (i gcás éilimh a rinneadh i 2017, is í 2015 an bhliain ranníoca atá i réim)agus 13 ranníocaíocht íoctha i mbliain ranníoca le déanaí, nó

source: • 26 paid contributions in each of the second and third last contribution years
ga: • 26 ranníocaíocht íoctha i ngach ceann den dara agus den tríú bliain deiridh ranníocaíochta

source: For claims made in 2017, the second last contribution year is 2015 and the third last contribution year is 2014
ga: Le haghaidh éilimh déanta i 2017, is í 2015 an dara bliain ranníocaíochta deiridh agus is í 2014 an tríú bliain ranníocaíochta deiridh

source: From the age of 25 onwards, you must have at least 260 paid contributions and
ga: Ó 25 bliain d'aois ar aghaidh, ní mór duit ar a laghad 260 ranníocaíocht íoctha a bheith agat agus

source: • At least 39 paid or credited contributions in the governing contribution year (2015 is the governing contribution year for claims made in 2017) and 13 paid contributions in a recent contribution year or
ga: • Ar a laghad 39 íoctha nó curtha chun sochair sa bhliain ranníoca atá i réim agus 13 ranníocaíocht íoctha i mbliain ranníoca le déanaí, nó

source: There are special rules for people aged 66 and over
ga: Tá rialacha speisialta ann do dhaoine atá 66 bliain d'aois agus os a chionn

source: Basically, you must have 260 contributions paid at any time, you must have 39 paid or credited in any of the two contribution years before reaching age 66 and you must have 13 paid contributions in a recent contribution year (before reaching age 66)
ga: Go bunúsach, caithfidh 260 ranníocaíocht a bheith íoctha agat ag aon tráth; ní mór duit 39 a bheith íoctha agat nó curtha chun sochair in aon cheann den dá bhliain ranníoca sula mbíonn tú 66 bliain d'aois agus 13 ranníocaíocht íoctha i mbliain ranníocaíochta le déanaí (gairid i ndiaidh duit 66 bliain d'aois a shroichint)

source: There are, however, a number of exceptions to this:
ga: Tá roinnt eisceachtaí áfach leis sin

source: If you reached 66 before 6 July 1992, you do not need 13 recently paid contributions
ga: Má shrois tú 66 bliain d'aois roimh 6 Iúil 1992, ní theastaíonn 13 ranníocaíocht íoctha le déanaí uait

source: If you reached age 66 before 1 October 1987, you need 156 paid contributions instead of 260; if you reached 66 between 1 October 1987 and 6 July 1992, you need 208 paid contributions
ga: Má shrois tú 66 bliain d'aois roimh 1 Deireadh Fómhair 1987, teastóidh 156 ranníocaíocht íoctha uait in áit 260; má shrois tú 66 bliain d'aois idir 1 Deireadh Fómhair 1987 agus 6 Iúil 1992, teastóidh 208 ranníocaíocht íoctha uait

source: If you are getting a State pension the PRSI contribution requirements vary according to age as follows:
ga: Má tá tú ag fáil Pinsean Stáit beidh na ceanglais faoi ranníocaíochtaí ÁSPC éagsúil de réir aoise mar seo a leanas:

source: │If you were: │You must have at least: │
ga: │Má bhí tú: │Caithfidh tú ar a laghad: │

source: │Aged 66 before 1 October 1987 │156 weeks PRSI paid since first starting work and 26 paid or credited in either of the last 2 complete tax years before you reached age 66
ga: │66 bliain d'aois roimh 1 Deireadh 1987 │156 seachtaine ÁSPC a bheith íoctha agat ó thosaigh tú ag obair an chéad lá riamh nó curtha chun sochair in aon cheann den 2 bhliain cánach iomlán deiridh sula shroich tú 66 bliain d'aois

source: │Aged 66 between 1 October 1987 and 6 July 1992 │208 weeks PRSI paid since first starting work and 39 weeks paid or credited in either of the last 2 complete tax years before you reached age 66
ga: │A bheith 66 bliain d'aois idir 1 Deireadh Fómhair 1987 agus 6 Iúil 1992 │208 seachtain ÁSPC a bheith íoctha agat ó thosaigh tú ag obair an chéad lá riamh agus 39 seachtaine íoctha nó curtha chun sochair in aon cheann den 2 bhliain cánach iomlán deiridh sula shroich tú 66 bliain d'aois

source: │Aged 66 on or after 6 July 1992 │260 weeks PRSI paid since first starting work and 39 weeks paid or credited in either of the last 2 complete tax years before you reached age 66
ga: │A bheith 66 bliain d'aois ar an 6 Iúil 1992 nó dá éis │260 seachtaine ÁSPC a bheith íoctha agat ó thosaigh tú ag obair an chéad lá riamh agus 39 seachtain íoctha nó curtha chun sochair in aon cheann den 2 bhliain cánach iomlán deiridh sula shroich tú 66 bliain d'aois

source: If you satisfy these conditions when you reach pension age, you will remain qualified for life
ga: Má chomhlánaíonn tú na coinníollacha seo nuair a shroicheann tú aois scoir, beidh tú fós cáilithe an chuid eile de do shaol

source: The recent contribution year rule for those under 66
ga: An riail a bhaineann leis an mbliain ranníocaíochta is déanaí dóibh sin faoi 66 bliain d'aois

source: In general, you must have 13 paid contributions in a recent contribution year
ga: Tríd is tríd, caithfidh 13 ranníocaíocht íoctha a bheith agat i mbliain ranníocaíochta le déanaí

source: This may be the same year as you have the 39 paid or credited contributions and the 13 paid may be part of those 39
ga: Is féidir leis sin a bheith ar an mbliain chéanna a bhfuil na 39 íoctha agat nó ranníocaíochtaí creidmheasa agus is féidir leis na 13 íoctha a bheith mar chuid den 39 sin

source: It may also be either of the two preceding contribution years or a subsequent year
ga: Is féidir leis freisin a bheith ar aon cheann den dá bhliain ranníoca roimhe sin nó bliain ina dhiaidh sin

source: If you are receiving any of the following payments, you do not need to have 13 recently paid contributions:
ga: Má tá tú ag fáil aon cheann de na híocaíochtaí seo a leanas, ní bheidh ort na 13 ranníocaíochtaí le déanaí a bheith íoctha agat:

source: • Illness Benefit (for 12 months or more)
ga: • Sochar Míchumais (ar feadh 12 mí nó níos mó)

source: • A combination of Jobseeker's Benefit and Jobseeker's Allowance for at least one year
ga: • Meascán de Sochar Cuardaitheora Poist agus Liúntas Cuardaitheora Poist ar feadh bliain amháin ar a laghad

source: You do not need to have 13 recently paid contributions if you are on a Community Employment Scheme, a Back to Work Scheme, a Vocational Training Opportunities Scheme or a Community Employment Development Programme
ga: Ní gá duit 13 ranníocaíocht íoctha le déanaí a bheith agat má tá tú ar Scéim Fostaíochta Pobail, ar Scéim Filleadh ar an Obair, ar Scéim Dheiseanna Oiliúint Ghairme nó ar Chlár Forbartha Fostaíochta Pobail

source: If you are aged 55 or over and are not getting any payment but are signing on, you don't need the 13 recently paid contributions either
ga: Má tá tú 55 bliain nó níos mó agus mura bhfuil tú ag fáil íocaíocht ar bith ach go bhfuil tú ag síniú duillín dífhostaíochta, ní theastóidh na 13 ranníocaíochtaí íoctha le déanaí uait ach an oiread

source: If you qualify for benefit at age 60, you retain that entitlement for life
ga: Má tá tú incháilithe le haghaidh sochair ag 60 bliain d'aois, coinneoidh tú an teidlíocht sin an chuid eile de do shaol

source: If you are aged between 61 and 65 and you do not meet the qualifying conditions at age 60, you must satisfy the qualifying conditions for the 25-65 age group
ga: Má tá tú idir 61 agus 65 bliain d'aois agus mura gcomhlíonann tú na coinníollacha cáilíochta ag aois 60, caithfidh tú na coinníollacha cáilíochta don aoisghrúpa 25-65 a chomhlíonadh

source: However, if you have retired on grounds of ill health or you are considered to be unemployed, you can apply for Illness Benefit or Jobseeker's Benefit, subject to satisfying the statutory conditions
ga: Mar sin féin, má chuaigh tú ar scor mar gheall ar dhrochshláinte nó má mheastar go bhfuil tú dífhostaithe, féadfaidh tú iarratas a dhéanamh ar Shochar Breoiteachta nó ar Shochar Cuardaitheora Poist, agus beidh sé sin faoi réir ag na coinníollacha reachtúla a chomhlíonadh

source: Your entitlement to these benefits may also lead to your being awarded credited contributions, which can be taken into account to extend coverage for treatment benefits for further periods
ga: B'fhéidir go mbronnfaí ranníocaíochtaí creidmheasa ort freisin mar ghealll go bhfuil tú i dteideal na sochar sin, agus féadfar iad sin a ghlacadh san áireamh chun an clúdach do shochair cóireála ar feadh tréimhsí breise amach anseo a leathnú

source: A spouse, civil partner or cohabitant may, of course, qualify in their own right if they have enough social insurance contributions
ga: Féadfaidh céilí/páirtnéirí sibhialta/comhchónaitheora, ar ndóigh, cáiliú ina gceart féin má bhíonn dóthain ranníocaíochtaí árachais shóisialta acu

source: If your spouse, civil partner or cohabitant does not have enough social insurance contributions he/she may still qualify for Treatment Benefit on your social insurance record
ga: Mura bhfuil dóthain ranníocaíochtaí árachais shóisialta ag do chéile/pháirtnéir sibhialta/chomhchónaitheoir, féadfaidh sé/sí cáiliú le haghaidh Sochair Cóireála mar do thaifead árachais shóisialaigh

source: To do this, you must qualify for Treatment Benefit and your spouse, civil partner or cohabitant must be dependent on you
ga: Chun é seo a dhéanamh, caithfidh tú bheith incháilithe le haghaidh Sochair Cóireála agus caithfidh do chéile/pháirtnéir sibhialta/chomhchónaitheoir bheith ag brath ort

source: A dependent spouse, civil partner or cohabitant must:
ga: Caithfidh do chéile/pháirtnéir sibhialta/chomhchónaitheoir,:

source: • Have a gross income of €100 or less per week
ga: • Ollioncam de €100 nó níos lú a bheith aige/aici in aghaidh na seachtaine

source: • Earn more than €100 per week and be dependent on you before entering or resuming insurable employment (at Class A, E, H, P or S)
ga: • Ioncam níos mó ná €100 a bheith aige/aici in aghaidh na seachtaine agus bheith ina cleithiúnach ort sula ndeachaigh sé/sí ag obair i bhfostaíocht inárachais nó ar ais ann (ag Aicme A, E, H, P nó S)

source: • Not get a social welfare payment (except Disablement Pension, Supplementary Welfare Allowance, Carer's Benefit or Child Benefit)
ga: • Gan bheith ag fáil íocaíocht leasa shóisialaigh (seachas Pinsean Míchumais, Liúntas Leasa Forlíontach, Sochar Cúramóra nó Sochar Leanaí)

source: • Have a Carer's Allowance or State Pension (Non-Contributory) and be dependent on you immediately before getting the Allowance or Pension
ga: • Bheith ag fáil Liúntas Cúramóra nó Pinsean Stáit (Neamhranníocach) ina cheart féin agus bheith ina cleithiúnach ort díreach sula bhfuair sé/sí liúntas nó pinsean

source: If an insured person dies and the dependent spouse or civil partner was entitled to benefit at the time of the death, they retain entitlement for as long as they remain widowed or a surviving civil partner
ga: Má fhaigheann duine le hárachas bás agus má bhí an céile nó an páirtnéir sibhialta cleithiúnach i dteideal sochar ag an am a bhfuair sé/sí bás, coinníonn an céile teidlíocht chomh fada agus gur baintreach fir/baintreach nó páirtnéir sibhialta marthanach i gcónaí é/í

source: Under this scheme, the Department pays the full cost of an oral examination once a calendar year
ga: Faoin scéim seo, íocann an Roinn costas iomlán an scrúdú bhéil uair amháin sa bhliain féilire

source: The examination is provided by private dentists who are on the Department of Social Protection's panel
ga: Tá an scrúdú soláthartha ag fiaclóirí príobháideacha atá ar phainéal de chuid na Roinn Coimirce Sóisialaí

source: Lists of dentists on the panel are available on welfare.ie
ga: Tá liosta de na fiaclóirí atá ar an bpainéal ar fáil ar welfare.ie

source: Most dentists are on the panel so you should not have any difficulty finding one
ga: Tá formhór fiaclóirí ar an bpainéal - mar sin níor chóir go mbeadh aon fhadhb agat duine a aimsiú

source: The dentist will have the application forms
ga: Beidh na foirmeacha iarratais ag an bhfiaclóir

source: These forms require details such as your Personal Public Service Number (PPS number)
ga: Teastaíonn sonraí ar nós Uimhir Phearsanta na Seirbhíse Poiblí (UPSP) ar na foirmeacha sin

source: If you are a dependent spouse or civil partner, you should give the PPS number of the insured person
ga: Más céile nó páirtnéir sibhialta cleithiúnach tú, ba chóir duit UPSP an duine a bhfuil árachas aige/aici a thabhairt

source: The Treatment Benefit Scheme entitles you to a free eyesight test
ga: Faoin Scéim Sochair Cóireála tá tú i dteideal tástáil radhairc saor in aisce

source: However, sight tests for VDUs, driving licences, etc., are not covered under the scheme
ga: Áfach, níl tástálacha radhairc i gcás VDU, ceadúnais tiomána, srl., clúdaithe faoin scéim

source: The examination is provided by opticians/optometrists who have a contract with the Department of Social Protection
ga: Soláthraíonn radharceolaithe/oftailmeolaithe a bhfuil conradh acu leis an Roinn Coimirce Sóisialaí an sochar

source: If you need contact lenses on medical grounds, the Department will pay half the cost up to a maximum of €500 provided you have a doctor's recommendation
ga: Má theastaíonn lionsaí tadhaill uait mar gheall ar do shláinte, íocfaidh an Roinn suas go dtí leath an chostais, faoi réir ag uasmhéid €500, ar an gcoinníoll go mbeidh sé molta ag an dochtúir

source: This applies to a small number of eye conditions that make wearing glasses impossible
ga: Baineann sé le méid beag coinníollacha súile a chur chun feidhme nach féidir gloiní a chaitheamh

source: Disposable lenses are not covered under the scheme
ga: Ní chlúdaítear lionsaí aon-uaire faoin Scéim um Sochar Cóireála

source: Contact lenses are not available on purely optical or cosmetic grounds
ga: Níl lionsaí tadhaill ar fhoras optúil nó cosmaideach ar fáil faoin scéim

source: Hearing aids may be provided by suppliers who have a contract with the Department of Social Protection
ga: D'fhéadfadh soláthróirí a bhfuil conradh acu leis an Roinn Coimirce Sóisialaí áiseanna éisteachta a chur ar fáil freisin

source: The Department pays half the cost of a hearing aid subject to a fixed maximum of €500 for each hearing aid every 4 years
ga: Íocann an Roinn leath de chostas áis éisteachta faoi réir ag uasmhéid €500 gach 4 bhliain

source: It also pays half the cost of repairs to aids
ga: Íocann sé freisin leath den chostas chun na háiseanna a dheisiú

source: You may get tax relief on certain non-routine dental treatments
ga: Féadfaidh tú faoiseamh cánach a fháil ar roinnt cóireálacha fiaclóireachta neamhgnáth

source: Treatment Benefit Scheme and EU Regulations
ga: Scéim um Sochar Cóireála agus Rialacháin de chuid an AE

source: If you were previously insurably employed in a country covered by EU Regulations and you do not qualify on your Irish PRSI record, your social insurance record in the other EU country may be used to help you qualify for Treatment Benefit
ga: Má bhí tú fostaithe le hárachas roimhe seo i dtír atá clúdaithe ag Rialacháin de chuid an AE agus mura gcáilíonn tú ar do thaifead ÁSPC in Éirinn, féadfar do thaifead árachais shóisialta sa tír eile de chuid an AE a úsáid chun cuidiú leat cáiliú le haghaidh Sochar Cóireála

source: You must have paid at least one reckonable PRSI contribution (Classes A, E, H, P and S) since your return to Ireland
ga: Caithfidh ar a laghad ranníocaíocht ÁSPC amháin inríofa a bheith íoctha agat (Aicmí A, E, H, P nó S) ó tháinig tú ar ais go hÉirinn

source: You will need to fill out form D1 if you are applying for dental services under the Treatment Benefit Scheme (form D2 if you are a dependent spouse, civil partner or cohabitant)
ga: Beidh ort foirm D1 a chomhlánú má tá tú ag déanamh iarratais ar sheirbhísí fiaclóireachta faoin Scéim um Sochar Cóireála (foirm D2 má tá tú ag déanamh iarratais ar sheirbhísí fiaclóireachta mar dhuine fásta incháilithe)

source: Forms are available from your dentist
ga: Tá foirmeacha ar fáil ó d'fhiaclóir

source: You will need to fill out form O1 if you are applying for optical services under the Treatment Benefit Scheme (form O2 if you are a dependent spouse, civil partner or cohabitant)
ga: Beidh ort foirm O1 a chomhlánú má tá tú ag déanamh iarratais ar sheirbhísí súl faoin Scéim um Sochar Cóireála (foirm O2 má tá tú ag déanamh iarratais ar sheirbhísí súl mar dhuine fásta incháilithe)

source: Forms are available from your optician or the Treatment Benefit Section
ga: Tá foirmeacha ar fáil ó do radharceolaí nó ón Rannóg Sochair Cóireála

source: You will need to fill out form MA if you are applying for aural services under the Treatment Benefit Scheme (form MA2 if you are a dependent spouse, civil partner or cohabitant)
ga: Beidh ort foirm MA a chomhlánú má tá tú ag déanamh iarratais ar sheirbhísí cluas faoin Scéim um Sochar Cóireála (foirm MA2 má tá tú ag déanamh iarratais ar sheirbhísí clois mar dhuine fásta incháilithe)

source: Forms are available from suppliers or the Treatment Benefit Section
ga: Tá foirmeacha ar fáil ó sholáthróirí nó ón Rannóg Sochair Cóireála

source: Application forms for dental, optical or aural services under the Treatment Benefit Scheme in other EU states are different from those above
ga: Tá foirmeacha iarratais ar sheirbhísí fiaclóireachta, súl nó cluas faoin Scéim um Sochar Cóireála i mballstáit eile de chuid an AE beagáinín difriúil óna foirmeacha thuas

source: Contact Treatment Benefit Section at the address below for copies of the forms and more information
ga: Téigh i dteagmháil leis an Rannóg Sochair Cóireála ag an seoladh thíos chun cóipeanna a fháil de na foirmeacha agus chun tuilleadh eolais a fháil

source: Department of Social Protection St
ga: Bóthar Naomh Oilibhéar Pluincéad

source: You can email the Treatment Benefit section using the secure enquiry form
ga: Is féidir leat ríomhphost don Rannóg Sochair Cóireála a sheoladh tríd an fhoirm fhiosraithe daingnithe a úsáid
